Revit 2015 API
WorksetTable Members
The WorksetTable type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the WorksetTable
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetActiveWorksetId
 Returns the active workset's WorksetId.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetWorkset(Guid)
 Returns the workset from a input Guid.
GetWorkset(WorksetId)
 Returns the workset from a input WorksetId.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
WorksetTable Class
Autodesk.Revit.DB Namespace